Feature: Регистрация на потребител

  Scenario Outline: Регистрация на потребител
    Given Потребителя отваря екрана за регистрация на нов потребител
    When Въведе потребителско име: "<потребителско име>"
    And Въведе парола: "<парола>"
    And Въведе втора парола: "<парола2>"
    And Въведе електронна поща: "<имейл>"
    And Натисне бутона за регистрация
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      | потребителско име | парола              | парола2             | имейл          | Съобщение                                       |
      | Кирилка           | asdf123!            | asdf123!            | kirilka@abv.bg | Успешна регистрация!                            |
      | Кирилка           | asdf123!            | kakobyrkataqparola1 | kirilka@abv.bg | Въведете еднакви пароли!                        |
      | Кирилка           | kakobyrkataqparola1 | asdf123!            | kirilka@abv.bg | Въведете еднакви пароли!                        |
      |                   | asdf123!            | asdf123!            | kirilka@abv.bg | Въведете име!                                   |
      | Ки                | asdf123!            | asdf123!            | kirilka@abv.bg | Потребителското име трябва да е поне 4 символа! |
      | Кирилка           | asdf123!            | asdf123!            | kirilka        | Въведете валиден имейл!                         |
      | Кирилка           | asdf123!            | asdf123!            |                | Въведете валиден имейл!                         |
      | Кирилка           |                     | asdf123!            | kirilka@abv.bg | Въведете парола!                                |
      | Кирилка           | asdf123!            |                     | kirilka@abv.bg | Въведете парола!                                |
      | Кирилка           |                     |                     | kirilka@abv.bg | Въведете парола!                                |
