Feature: Регистриран потребител трие тема

  Scenario Outline: Регистриран потребител трие тема
  
    Given Потребителя отваря тема
    When Потребителя натисне бутона за изтриване на тема с роля: "<роля>"
    Then Вижда съобение: "<Съобщение>"

    Examples: 
      | роля  | Съобщение 																			|
      | admin | Успешно изтрихте темата 												|
      | user  | Нямате администраторски права за това действие  |
      |       |Само регистрирани потребители имат права за това действие|