Feature: Вход в системата

	Background:
		Given Потребителя отваря екрана за вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    When Въведе потребителско име: "Кирилка"
    And Въведе потребителска парола: "asdf123!"
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Успешно влизане!"
    
  Scenario: Вход в системата без парола
    When Въведе потребителско име: "Кирилка"
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
  Scenario: Вход в системата без потребителско име
    When Въведе потребителска парола: "asdf123!"
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
  Scenario: Вход в системата без потребителски данни
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
  Scenario: Вход в системата с невалидни потребителски данни
    When Въведе потребителско име: "Кирилчо"
    And Въведе потребителска парола: "asdf123!"
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Грешни данни!"
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Въведе потребителско име: "Кирилка"
    And Въведе потребителска парола: "Wrong password!"
    And Натисне бутона за вход в системата
    Then Вижда съобщение: "Грешни данни!"